In [2]:
import pandas as pd
import numpy as np
import os

In [20]:
path = r'C:\Users\cmfag\OneDrive\Desktop\Data Analyst Specialist\Achievement 4\4.3_orders_products\02 Data\Prepared Data'

In [23]:
df_prods= pd.read_csv(os.path.join(path, 'products.csv'), index_col = False)

In [22]:
df_ords= pd.read_csv(os.path.join(path, 'orders_wrangled.csv'), index_col = False)

In [28]:
df_ords.describe()

,Unnamed: 0,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.710541e+06,1.710542e+06,1.029782e+05,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,9.875817e+05,9.875817e+05,5.953372e+04,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,0.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,8.552705e+05,8.552715e+05,5.139400e+04,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.710541e+06,1.710542e+06,1.026890e+05,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.565812e+06,2.565812e+06,1.543850e+05,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,3.421082e+06,3.421083e+06,2.062090e+05,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

DATOS DE TIPOS MIXTOS

In [37]:
#CREATE A DATAFRAME 

df_test = pd.DataFrame()

In [41]:
# Create a mixded type column

df_test['mix'] = ['a','b',1, True]

In [43]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [163]:
# Código dificil. Tener en cuenta que lo necesitaré a futuro!
#The function for checking whether a dataframe contains any mixed-type columns is as follows


for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

C:\Users\cmfag\AppData\Local\Temp\ipykernel_12392\360884088.py:6: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)

In [63]:

#his will convert a column’s data type from numeric to string, but there may be times where you need to go in the opposite direction, 
#as well—from string to numeric. To change this, simply update the str within the astype() function to int64 or whichever numeric data type you 
#want to use.

df_test['mix'] = df_test['mix'].astype('str')

FINDING MISSING VALUES

In [72]:

#he isnull() + sum() function is used to find missing observations, with “observations” here referring to entries in your dataframe


df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [74]:
# it’s missing 16 values in product_name

In [80]:
#subset only with hte missing values in product_name

df_nan = df_prods [df_prods['product_name'].isnull() == True] 

df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

Addressing Missing Values

In [111]:
#Method 1 - Create a new variable that acts like a flag based on the missing value.


#Method 2 - Impute the value with the mean or median of the column (if the variable is numeric).

# find the mean: df.describe()  and to substitute the missing values with the mean: df['column with missings'].fillna(mean value, inplace=True)
# find the median: df_prods.median() and substitute the missing values with the mmedian: df['column with missings'].fillna(median value, inplace=True)


#Method 3 - Remove or filter out the missing data.

#Linear interpolation can be also using


# in this particular case, we will impute the missing values

In [99]:
df_prods.dtypes

product_id         int64
product_name      object
aisle_id           int64
department_id      int64
prices           float64
dtype: object

In [101]:
df_prods.shape

(49693, 5)

In [109]:
#nrs of raw thar have to be removed form the original data. 

df_nan.shape

(16, 5)

In [113]:
#creating a new DF cales df_prods_clean excluding the missing values by ussing .isnull()

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [127]:
# now the cleaned df
df_prods_clean.shape

# other way to drop all missing values by overwriting the df_prods
 #   df_prods.dropna(inplace = True)
  #  df_prods.dropna(subset = [‘product_name’], inplace = True)

(49677, 5)

DUPLICATES

#Finding Duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]
df_dups

#df_dups is a df that now contents all the duplicates

Adressing Duplicates

In [139]:
#determining how many rows need to be drop out 

df_prods_clean.shape

(49677, 5)

In [147]:
#then creating a new df 

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

df_prods_clean_no_dups

#the 5 duplicated are delated- possible to see verifiying the shape of the df.

,product_id,product_name,aisle_id,department_id,prices
0,1,Chocolate Sandwich Cookies,61,19,5.8
1,2,All-Seasons Salt,104,13,9.3
2,3,Robust Golden Unsweetened Oolong Tea,94,7,4.5
3,4,Smart Ones Classic Favorites Mini Rigatoni Wit...,38,1,10.5
4,5,Green Chile Anytime Sauce,5,13,4.3
...,...,...,...,...,...
49688,49684,"Vodka, Triple Distilled, Twist of Vanilla",124,5,5.3
49689,49685,En Croute Roast Hazelnut Cranberry,42,1,3.1
49690,49686,Artisan Baguette,112,3,7.8
49691,49687,Smartblend Healthy Metabolism Dry Cat Food,41,8,4.7
49692,49688,Fresh Foaming Cleanser,73,11,13.5

Tidying Up and Exporting Changes

In [158]:
df_prods_clean_no_dups.to_csv(os.path.join(path,'products_checked.csv'))